- name: standalone
  expression: $(number1)
  scope:
    number1:
      number:
        1000000
  expected:
    number:
      1000000

- name: at start
  expression: $(number1)suffix
  scope:
    number1:
      number:
        99999999
  expected:
    string:
      99999999suffix

- name: at end
  expression: prefix$(number1)
  scope:
    number1:
      number:
        2.3
  expected:
    string:
      prefix2.3

- name: within
  expression: prefix$(number1)suffix
  scope:
    number1:
      number:
        2.3
  expected:
    string:
      prefix2.3suffix
